#+title: OCI CAPI cluster

Write a tfvars file

#+begin_src hcl
tenancy_ocid     = "TENANCY OCID"
user_ocid        = "YOUR USER OCID"
private_key_path = "YOUR PRIVATE KEY PATH"
fingerprint      = "THE FINGERPRINT FOR YOUR PRIVATE KEY"
region           = "us-sanjose-1"
compartment_ocid = "YOUR COMPARTMENT OCID"
#+end_src

Provision network resources

#+begin_src shell
tofu apply --var-file ./.tfvars
#+end_src

Bring up Kubernetes locally

#+begin_src bash
kind create cluster
#+end_src

Define env

#+begin_src bash :tangle .envrc
[ ! -f priv.env ] || . priv.env
# export OCI_TENANCY_ID=
# export OCI_USER_ID=
# export OCI_CREDENTIALS_FINGERPRINT=
# export OCI_CREDENTIALS_KEY_B64= # $(base64 < path/to/a/key.pem | tr -d '\n')
export OCI_REGION=us-sanjose-1

export OCI_TENANCY_ID_B64="$(echo -n "$OCI_TENANCY_ID" | base64 | tr -d '\n')"
export OCI_CREDENTIALS_FINGERPRINT_B64="$(echo -n "$OCI_CREDENTIALS_FINGERPRINT" | base64 | tr -d '\n')"
export OCI_USER_ID_B64="$(echo -n "$OCI_USER_ID" | base64 | tr -d '\n')"
export OCI_REGION_B64="$(echo -n "$OCI_REGION" | base64 | tr -d '\n')"

# if bootstraping from inside OCI
export USE_INSTANCE_PRINCIPAL="false"
export USE_INSTANCE_PRINCIPAL_B64="$(echo -n "$USE_INSTANCE_PRINCIPAL" | base64 | tr -d '\n')"
#+end_src

allow env from .envrc

#+begin_src bash
direnv allow
#+end_src

bootstrap capi with oci

#+begin_src bash
clusterctl init --bootstrap talos:v0.6.5 --control-plane talos:v0.5.6 --infrastructure oci:v0.16.0
#+end_src

create a namespace

#+begin_src bash
kubectl create ns sharingio
#+end_src

#+RESULTS:
#+begin_example
namespace/sharingio created
#+end_example

Define more env

#+begin_src bash :tangle .envrc
# export OCI_COMPARTMENT_ID=
# export OCI_IMAGE_ID=ocid1.image.oc1.us-sanjose-1.aaaaaaaazpwpyk7kh6mbu2g6yihups2zf5uwt7moehbafxsu4idaew6nggxq # NOTE Oracle 8
export OCI_IMAGE_ID=ocid1.image.oc1.us-sanjose-1.aaaaaaaaqemyxu4dnhuapt6dfzuhq6rp5h3f7ld3yqh3crwiu5qtzlk6woma
export OCI_CONTROL_PLANE_MACHINE_TYPE=VM.Standard.A1.Flex
export OCI_CONTROL_PLANE_MACHINE_TYPE_OCPUS=4
export OCI_NODE_MACHINE_TYPE=VM.Standard.A1.Flex
export OCI_NODE_MACHINE_TYPE_OCPUS=8
export OCI_SSH_KEY=
export OCI_CONTROL_PLANE_PV_TRANSIT_ENCRYPTION=true
export OCI_NODE_PV_TRANSIT_ENCRYPTION=true

export TALOS_INSTALL_IMAGE=factory.talos.dev/installer/d01e4eb407f9a242831748cab07de55550fdcfe8be65ce4defd258a93d94562f:v1.7.6
export CLUSTER_NAME=cncfocicapi
export CONTROL_PLANE_MACHINE_COUNT=3
export KUBERNETES_VERSION=v1.30.1
export NAMESPACE=sharingio
export POD_CIDR=192.168.0.0/16
export SERVICE_CIDR=10.128.0.0/12
export NODE_MACHINE_COUNT=6
export OCI_NETWORK_SUBNET_NAME="${CLUSTER_NAME}-subnet"

export OCI_NETWORK_SECURITY_GROUP_ID="$(tofu output --raw oci_network_security_group_id || false)"
export OCI_NETWORK_SUBNET_ID="$(tofu output --raw oci_network_subnet_id)"
#+end_src

generate a cluster config

#+begin_src bash :epilogue ". .envrc ; \n"
clusterctl -n sharingio generate cluster "$CLUSTER_NAME" --from ./cluster-template.yaml --write-to ./cluster.yaml
#+end_src

#+RESULTS:
#+begin_example
#+end_example

apply the cluster

#+begin_src bash
kubectl -n sharingio apply -f ./cluster.yaml 2>&1
#+end_src

#+RESULTS:
#+begin_example
cluster.cluster.x-k8s.io/cncfocicapi created
ocicluster.infrastructure.cluster.x-k8s.io/cncfocicapi created
taloscontrolplane.controlplane.cluster.x-k8s.io/cncfocicapi-control-plane created
ocimachinetemplate.infrastructure.cluster.x-k8s.io/cncfocicapi-control-plane created
ocimachinetemplate.infrastructure.cluster.x-k8s.io/cncfocicapi-md-0 created
talosconfigtemplate.bootstrap.cluster.x-k8s.io/cncfocicapi-md-0 created
machinedeployment.cluster.x-k8s.io/cncfocicapi-md-0 created
#+end_example

view the world

#+begin_src shell
kubectl -n sharingio get $(kubectl -n sharingio api-resources | grep x-k8s | awk '{print $1}' | tr '\n' ',' | sed 's/,$//g')
#+end_src

#+RESULTS:
#+begin_example
NAME                                                                     AGE
talosconfig.bootstrap.cluster.x-k8s.io/cncfocicapi-control-plane-9798j   5m32s
talosconfig.bootstrap.cluster.x-k8s.io/cncfocicapi-control-plane-fkrbr   5m33s
talosconfig.bootstrap.cluster.x-k8s.io/cncfocicapi-control-plane-tjv2n   5m32s
talosconfig.bootstrap.cluster.x-k8s.io/cncfocicapi-md-0-hd9wn-6pk7x      6m56s
talosconfig.bootstrap.cluster.x-k8s.io/cncfocicapi-md-0-hd9wn-fb8zn      6m57s
talosconfig.bootstrap.cluster.x-k8s.io/cncfocicapi-md-0-hd9wn-gvn2c      6m56s
talosconfig.bootstrap.cluster.x-k8s.io/cncfocicapi-md-0-hd9wn-h2kv2      6m56s
talosconfig.bootstrap.cluster.x-k8s.io/cncfocicapi-md-0-hd9wn-r5cws      6m56s
talosconfig.bootstrap.cluster.x-k8s.io/cncfocicapi-md-0-hd9wn-vlhqc      6m56s
talosconfig.bootstrap.cluster.x-k8s.io/sharingio-control-plane-c7qpb     26m
talosconfig.bootstrap.cluster.x-k8s.io/sharingio-control-plane-z7j4r     26m
talosconfig.bootstrap.cluster.x-k8s.io/sharingio-control-plane-zj9g5     26m

NAME                                                              AGE
talosconfigtemplate.bootstrap.cluster.x-k8s.io/cncfocicapi-md-0   6m57s

NAME                                   CLUSTERCLASS   PHASE         AGE     VERSION
cluster.cluster.x-k8s.io/cncfocicapi                  Provisioned   6m57s
cluster.cluster.x-k8s.io/sharingio                    Deleting      27m

NAME                                                  CLUSTER       REPLICAS   READY   UPDATED   UNAVAILABLE   PHASE       AGE     VERSION
machinedeployment.cluster.x-k8s.io/cncfocicapi-md-0   cncfocicapi   6                  6         6             ScalingUp   6m57s   v1.30.1

NAME                                                       CLUSTER       NODENAME   PROVIDERID   PHASE          AGE     VERSION
machine.cluster.x-k8s.io/cncfocicapi-control-plane-phr6z   cncfocicapi                           Provisioning   5m32s   v1.30.1
machine.cluster.x-k8s.io/cncfocicapi-control-plane-qq5zq   cncfocicapi                           Provisioning   5m32s   v1.30.1
machine.cluster.x-k8s.io/cncfocicapi-control-plane-rg2xt   cncfocicapi                           Provisioning   5m32s   v1.30.1
machine.cluster.x-k8s.io/cncfocicapi-md-0-hd9wn-6pk7x      cncfocicapi                           Pending        6m56s   v1.30.1
machine.cluster.x-k8s.io/cncfocicapi-md-0-hd9wn-fb8zn      cncfocicapi                           Pending        6m56s   v1.30.1
machine.cluster.x-k8s.io/cncfocicapi-md-0-hd9wn-gvn2c      cncfocicapi                           Pending        6m56s   v1.30.1
machine.cluster.x-k8s.io/cncfocicapi-md-0-hd9wn-h2kv2      cncfocicapi                           Pending        6m56s   v1.30.1
machine.cluster.x-k8s.io/cncfocicapi-md-0-hd9wn-r5cws      cncfocicapi                           Pending        6m56s   v1.30.1
machine.cluster.x-k8s.io/cncfocicapi-md-0-hd9wn-vlhqc      cncfocicapi                           Pending        6m56s   v1.30.1
machine.cluster.x-k8s.io/sharingio-control-plane-6kn5v     sharingio                             Deleting       26m     v1.30.1
machine.cluster.x-k8s.io/sharingio-control-plane-8ntmx     sharingio                             Deleting       26m     v1.30.1
machine.cluster.x-k8s.io/sharingio-control-plane-bfv5k     sharingio                             Deleting       26m     v1.30.1

NAME                                                 CLUSTER       REPLICAS   READY   AVAILABLE   AGE     VERSION
machineset.cluster.x-k8s.io/cncfocicapi-md-0-hd9wn   cncfocicapi   6                              6m57s   v1.30.1

NAME                                                                        READY   INITIALIZED   REPLICAS   READY REPLICAS   UNAVAILABLE REPLICAS
taloscontrolplane.controlplane.cluster.x-k8s.io/cncfocicapi-control-plane                         3                           3
taloscontrolplane.controlplane.cluster.x-k8s.io/sharingio-control-plane                           3                           3

NAME                                                     AGE
ocicluster.infrastructure.cluster.x-k8s.io/cncfocicapi   6m57s

NAME                                                                         AGE
ocimachine.infrastructure.cluster.x-k8s.io/cncfocicapi-control-plane-5m2ln   5m33s
ocimachine.infrastructure.cluster.x-k8s.io/cncfocicapi-control-plane-phxbg   5m32s
ocimachine.infrastructure.cluster.x-k8s.io/cncfocicapi-control-plane-vkrjc   5m32s
ocimachine.infrastructure.cluster.x-k8s.io/cncfocicapi-md-0-hd9wn-6pk7x      6m56s
ocimachine.infrastructure.cluster.x-k8s.io/cncfocicapi-md-0-hd9wn-fb8zn      6m57s
ocimachine.infrastructure.cluster.x-k8s.io/cncfocicapi-md-0-hd9wn-gvn2c      6m56s
ocimachine.infrastructure.cluster.x-k8s.io/cncfocicapi-md-0-hd9wn-h2kv2      6m56s
ocimachine.infrastructure.cluster.x-k8s.io/cncfocicapi-md-0-hd9wn-r5cws      6m56s
ocimachine.infrastructure.cluster.x-k8s.io/cncfocicapi-md-0-hd9wn-vlhqc      6m56s
ocimachine.infrastructure.cluster.x-k8s.io/sharingio-control-plane-247f4     26m
ocimachine.infrastructure.cluster.x-k8s.io/sharingio-control-plane-4j9h6     26m
ocimachine.infrastructure.cluster.x-k8s.io/sharingio-control-plane-rjqwb     26m

NAME                                                                           AGE
ocimachinetemplate.infrastructure.cluster.x-k8s.io/cncfocicapi-control-plane   6m57s
ocimachinetemplate.infrastructure.cluster.x-k8s.io/cncfocicapi-md-0            6m57s
#+end_example

Get the Talosconfig

#+begin_src shell
kubectl -n sharingio get secret cncfocicapi-talosconfig -o go-template='{{ .data.talosconfig | base64decode }}' > ./talosconfig
#+end_src

#+RESULTS:
#+begin_example
#+end_example

Get the Kubeconfig

#+begin_src shell
kubectl -n sharingio get secret sharingio-kubeconfig -o go-template='{{ .data.value | base64decode }}' > ./kubeconfig
#+end_src

#+RESULTS:
#+begin_example
#+end_example

Tear down

#+begin_src shell
kubectl -n sharingio delete -f ./cluster.yaml 2>&1
#+end_src

#+RESULTS:
#+begin_example
cluster.cluster.x-k8s.io "cncfocicapi" deleted
ocicluster.infrastructure.cluster.x-k8s.io "cncfocicapi" deleted
taloscontrolplane.controlplane.cluster.x-k8s.io "cncfocicapi-control-plane" deleted
ocimachinetemplate.infrastructure.cluster.x-k8s.io "cncfocicapi-control-plane" deleted
ocimachinetemplate.infrastructure.cluster.x-k8s.io "cncfocicapi-md-0" deleted
talosconfigtemplate.bootstrap.cluster.x-k8s.io "cncfocicapi-md-0" deleted
Error from server (NotFound): error when deleting "./cluster.yaml": machinedeployments.cluster.x-k8s.io "cncfocicapi-md-0" not found
#+end_example
